projectFiles/straightPipe/Re100/q-1000/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.003;

boundaryField
{
   heatWall
   {
     type            kqRWallFunction;
     value           uniform 0;   
   }   
   wall
    {
     type            kqRWallFunction;
     value           uniform 0;   
    }
    outlet
    {
       type            inletOutlet;
       inletValue      uniform 0.003;
    }

    inlet
    {
     type            turbulentIntensityKineticEnergyInlet;
     intensity       0.05;       // 5% turbulent intensity
     value           uniform 0.0012;
    }
}


// ************************************************************************* //
